{
  "version": "2.1",
  "notes": "SPARK Statements (V2) with age-appropriate examples for 11–15 year-olds. Likert: Strongly Agree → Strongly Disagree.",
  "scale": {
    "label": "Strongly Agree → Strongly Disagree",
    "options": [
      "Strongly Agree",
      "Agree",
      "Neither",
      "Disagree",
      "Strongly Disagree"
    ],
    "value_mapping_note": "Map as needed to your scoring system (e.g., SA=5… SD=1)."
  },
  "themes": [
    {
      "code": "S",
      "name": "Self-direction (Initiative)",
      "focus": "Taking initiative, being proactive, bias toward action",
      "items": [
        {
          "id": "S01",
          "text": "I am willing to risk failure to reach my goals.",
          "examples": [
            "You try out for the school team (or a local club) even if you’re not sure you’ll make it, because you want to improve."
          ]
        },
        {
          "id": "S02",
          "text": "When I work at something, I care about doing my best.",
          "examples": [
            "You rework a design or paragraph until it’s clear and neat, then ask a friend or teacher for one suggestion to improve it."
          ]
        },
        {
          "id": "S03",
          "text": "I like coming up with new ways to solve problems.",
          "examples": [
            "In art you test a different technique to get a texture you want; at home you rearrange your study space to help you focus."
          ]
        },
        {
          "id": "S04",
          "text": "I take the initiative myself, rather than relying on others",
          "examples": [
            "For a group poster, you set up the task list and volunteer to do the first draft without being told, then invite others to add."
          ]
        },
        {
          "id": "S05",
          "text": "When I set a goal, I immediately start working on it",
          "examples": [
            "You decide to learn 10 Spanish verbs a week and spend 10 minutes that evening making the first set of flashcards."
          ]
        },
        {
          "id": "S06",
          "text": "I make plans that help me accomplish what I aim for.",
          "examples": [
            "For a science project or music performance, you break it into mini‑deadlines in your planner and tick them off across the week."
          ]
        }
      ]
    },
    {
      "code": "P",
      "name": "Purpose (Hope, Aspiration, Locus of Control)",
      "focus": "Hope, aspirations, sense of direction",
      "items": [
        {
          "id": "P01",
          "text": "I expect good things to happen to me.",
          "examples": [
            "You enter a school competition believing your effort could lead to a positive outcome, even if you don’t win."
          ]
        },
        {
          "id": "P02",
          "text": "I am excited about my future.",
          "examples": [
            "You look up college courses or careers and enjoy seeing which subjects link to them."
          ]
        },
        {
          "id": "P03",
          "text": "I trust that my future will turn out well.",
          "examples": [
            "After a low test score, you believe that with practice and help from teachers you can improve next time."
          ]
        },
        {
          "id": "P04",
          "text": "My life will make a difference in the world.",
          "examples": [
            "You volunteer for an eco‑club litter pick because you feel your actions matter."
          ]
        },
        {
          "id": "P05",
          "text": "I am doing things now that will help me to achieve my purpose in life.",
          "examples": [
            "You practise coding 15 minutes a day because you think tech might be part of your future."
          ]
        },
        {
          "id": "P06",
          "text": "I have long term dreams, and I am taking steps to achieve them",
          "examples": [
            "If you want to be a nurse, you choose extra science revision sessions and watch short NHS career videos."
          ]
        }
      ]
    },
    {
      "code": "A",
      "name": "Awareness (Relationships and Empathy)",
      "focus": "Working with others, empathy, fostering relationships",
      "items": [
        {
          "id": "A01",
          "text": "I feel bad when someone gets their feelings hurt.",
          "examples": [
            "You notice a classmate left out at lunch and it bothers you."
          ]
        },
        {
          "id": "A02",
          "text": "I understand how those close to me feel.",
          "examples": [
            "You can tell your friend is stressed before a test and you check in with them."
          ]
        },
        {
          "id": "A03",
          "text": "It is important to me to understand how other people feel.",
          "examples": [
            "During a debate, you restate the other side’s point before sharing your view."
          ]
        },
        {
          "id": "A04",
          "text": "I am happy when others succeed.",
          "examples": [
            "You congratulate a classmate who got a higher grade than you without sarcasm."
          ]
        },
        {
          "id": "A05",
          "text": "I go out of my way to help others.",
          "examples": [
            "You stay behind after club to help tidy equipment that isn’t yours."
          ]
        },
        {
          "id": "A06",
          "text": "I help others even if it requires a lot of my time.",
          "examples": [
            "You spend part of break helping a partner catch up on missed notes, then check they understand before the next lesson."
          ]
        },
        {
          "id": "A07",
          "text": "I encourage my friends to be the best they can be.",
          "examples": [
            "You remind a friend about their art portfolio deadline and offer to look over it with them after school."
          ]
        }
      ]
    },
    {
      "code": "R",
      "name": "Resilience (Diligence, Reliability, Never Giving Up)",
      "focus": "Grit, perseverance, reliability",
      "items": [
        {
          "id": "R01",
          "text": "I put in more effort than many of my peers to achieve success.",
          "examples": [
            "You complete one extra retrieval quiz at home or practise an extra 15 minutes on a skill when others stop."
          ]
        },
        {
          "id": "R02",
          "text": "I see tasks through to completion even when I encounter obstacles.",
          "examples": [
            "When your slideshow corrupts, you rebuild the key slides instead of giving up."
          ]
        },
        {
          "id": "R03",
          "text": "People can count on me to get tasks done",
          "examples": [
            "If you promise to bring resources for group work, you bring them on time and let people know if anything changes."
          ]
        },
        {
          "id": "R04",
          "text": "I always do the things that I say I am going to do",
          "examples": [
            "You told your teacher you’d attend revision club, so you go—even when you’re tired."
          ]
        },
        {
          "id": "R05",
          "text": "I persist and find ways to overcome challenges even when tasks become difficult.",
          "examples": [
            "Stuck on a tricky equation, you try a different method and ask a classmate before asking the teacher."
          ]
        },
        {
          "id": "R06",
          "text": "I find creative ways to overcome challenges when things don't go as planned.",
          "examples": [
            "If the library is full, you use printed notes and a quiet classroom; if your device dies, you switch to paper and keep going."
          ]
        },
        {
          "id": "R07",
          "text": "When I face setbacks, I reflect on what went wrong and adjust my approach.",
          "examples": [
            "After losing marks for careless errors, you start underlining key words in questions."
          ]
        }
      ]
    },
    {
      "code": "K",
      "name": "Knowledge (Curiosity, Attention, Role of Student)",
      "focus": "Curiosity, attention, valuing education",
      "items": [
        {
          "id": "K01",
          "text": "If something interests me, I try to learn more about it.",
          "examples": [
            "After a history lesson, you watch a short video about the same topic at home."
          ]
        },
        {
          "id": "K02",
          "text": "I use the knowledge I gain at school in my life.",
          "examples": [
            "You use budgeting from maths to plan saving for a school trip or to manage pocket money."
          ]
        },
        {
          "id": "K03",
          "text": "Being a student is central to my identity ",
          "examples": [
            "You keep an organised exercise book and take pride in adding a brief ‘next step’ after feedback."
          ]
        },
        {
          "id": "K04",
          "text": "I take charge of my own learning.",
          "examples": [
            "You set your own practice questions or make flashcards without being told."
          ]
        },
        {
          "id": "K05",
          "text": "I care about doing well in school",
          "examples": [
            "You choose to redo a piece of work to move it from ‘good’ to ‘great’."
          ]
        },
        {
          "id": "K06",
          "text": "I always pay attention in class",
          "examples": [
            "You face the speaker, track key points in your notes, and ask a short clarifying question when something isn’t clear."
          ]
        },
        {
          "id": "K07",
          "text": "I always come to class well-prepared",
          "examples": [
            "You pack your bag the night before—with the right books and any printed sheets—without being reminded by parents or carers."
          ]
        }
      ]
    }
  ],
  "counts": {
    "S": 6,
    "P": 6,
    "A": 7,
    "R": 7,
    "K": 7,
    "total_items": 33
  }
}